Merge pull request #14 from xianshi3/develop
docs: 架构图升级为Mermaid
